src/test/resources/fixtures/client/create_a_payment_response.json

{
    "payments": {
        "amount": 2000,
        "amount_refunded": 0,
        "charge_date": "2015-04-17",
        "created_at": "2015-04-14T09:34:09.141Z",
        "currency": "GBP",
        "description": null,
        "id": "PM00008KWW97PE",
        "links": {
            "creditor": "CR000035EME9H5",
            "mandate": "MD00001PEYCSQF"
        },
        "metadata": {
            "foo": "bar"
        },
        "reference": null,
        "status": "pending_submission"
    }
}
